# better_text.py

class Improve():
    
    def city_name(name):

        l1 = ['Ρόδος', 'Κόρινθος', 'Χίος', 'Ναύπακτος', 'Κάλυμνος', 'Ιαλυσός', 'Ζάκυνθος', 'Σίνδος', 'Νέα Πέργαμος',
              'Σάμος', 'Νάξος', 'Ανάβυσσος', 'Νέα Αγχίαλος', 'Κάρυστος', 'Σκιάθος', 'Τήνος', 'Αλίαρτος', 'Κίσσαμος',
              'Νέα Ραιδεστός', 'Μύκονος', 'Αμάρυνθος', 'Νέα Πέραμος', 'Ιερισσός', 'Σκόπελος', 'Νέα Κίος', 'Πάλαιρος',
              'Πύλος', 'Αγιάσος', 'Νέα Λάμψακος', 'Κέφαλος', 'Πεντάλοφος']

        l2 = ['Ιωάννινα', 'Τρίκαλα', 'Χανιά', 'Γιαννιτσά', 'Μέγαρα', 'Καλύβια', 'Γρεβενά', 'Γλυκά Νερά', 'Διαβατά',
              'Φάρσαλα', 'Σπάτα', 'Κουφάλια', 'Κουνουπιδιανά', 'Φιλιατρά', 'Ψαχνά', 'Αμπελάκια', 'Κανάλια', 'Περιβόλια',
              'Βασιλικά', 'Κύμινα', 'Κιμμέρια', 'Λαγυνά', 'Βάγια', 'Μάλια', 'Οινόφυτα', 'Δεμένικα', 'Καμένα Βούρλα',
              'Πηγάδια', 'Λεχαινά', 'Βραχναίικα', 'Λιμενάρια', 'Νέα Μάλγαρα', 'Ανώγεια', 'Σελήνια', 'Σήμαντρα']

        try:
            if name.count(' ') != 0:
                return 'στην περιοχή {}'.format(name)

            elif l1.count(name) != 0:
                return '{} {}'.format("στην", name[:-1])
            elif l2.count(name) != 0:
                return '{} {}'.format("στα", name)

            elif name == 'Αλεπού' or name == 'Λεπενού' :
                return '{} {}'.format("στην", name)
            elif name == 'Θρακομακεδόνες' or name == 'Σοφάδες' or name == 'Ταγαράδες':
                return '{} {}'.format("στους", name)
            elif name == 'Άργος' or name == 'Άστρος' or name == 'Ροδολίβος':
                return '{} {}'.format("στο", name)

            elif name[-1] == 'α' or name[-1] == 'η' or name[-1] == 'ω' or name[-1] == 'ά' or name[-1] == 'ή' or name[-1] == 'ώ' :
                return '{} {}'.format("στην", name)
            elif name[-2:] == 'ως' or name[-2:] == 'ώς' :
                return '{} {}'.format("στην", name[:-1])
            elif name[-2:] == 'ος' or name[-2:] == 'ας' or name[-2:] == 'ης' or name[-2:] == 'ός' or name[-2:] == 'άς' or name[-2:] == 'ής' :
                return '{} {}'.format("στον", name[:-1])
            elif name[-1] == 'ο' or name[-2:] == 'ις' or name[-1] == 'υ' or name[-1] == 'ό' or name[-2:] == 'ίς' or name[-2:] == 'ύ' :
                return '{} {}'.format("στο", name)
            elif name[-2:] == 'ες' or name[-2:] == 'ές':
                return '{} {}'.format("στις", name)
            elif name[-2:] == 'οι' or name[-2:] == 'οί':
                return '{} {}ους'.format("στους", name[:-2])
            elif name[-2:] == 'ου' or name[-2:] == 'ού':
                return '{} {}'.format("στα", name)
            else:
                return '{} {}'.format("στο", name)
        except IndexError:
            return 'στην επιλεγμένη τοποθεσία {}'.format(name)



